<script setup lang="ts">
import Header from '@/components/partials/header/index.vue';
import Footer from '@/components/partials/Footer.vue';
</script>

<template>
  <div class="min-h-screen h-full flex flex-col bg-orange-100 relative">
    <Header />
    <div class="max-w-6xl m-auto w-full flex flex-col gap-y-4">
      <div class="flex flex-col w-full p-5 md:p-10 bg-white rounded-xl">
        <h1 class="text-center text-2xl font-bold mb-4">Пользовательское соглашение</h1>
        <h2 class="text-xl font-semibold mb-2">1. Общие положения</h2>
        <p class="mb-4">
          1.1. Настоящее Соглашение определяет порядок использования музыкального стримингового
          сервиса "Wave Music" (далее – Сервис) и условия доступа к музыкальному контенту.
        </p>
        <p class="mb-4">
          1.2. Использование Сервиса означает безоговорочное согласие пользователя с настоящим
          Соглашением и указанными в нем условиями. В случае несогласия с условиями Соглашения
          пользователь должен воздержаться от использования Сервиса.
        </p>
        <h2 class="text-xl font-semibold mb-2">2. Регистрация в сервисе</h2>
        <p class="mb-4">
          2.1. Для доступа к платному контенту пользователь должен пройти процедуру регистрации.
        </p>
        <p class="mb-4">
          2.2. При регистрации пользователь обязуется предоставить достоверные и актуальные данные.
        </p>
        <p class="mb-4">
          2.3. Пользователь несет ответственность за сохранение конфиденциальности своих учетных
          данных.
        </p>
        <h2 class="text-xl font-semibold mb-2">3. Подписка</h2>
        <p class="mb-4">
          3.1. Доступ к музыкальному контенту осуществляется на основе платной подписки.
        </p>
        <p class="mb-4">
          3.2. Пользователь обязуется предоставить достоверные данные для оформления подписки.
        </p>
        <p class="mb-4">
          3.3. Сервис не несет ответственности за неправильно указанные данные, которые могут
          привести к невозможности предоставления доступа к контенту.
        </p>
        <h2 class="text-xl font-semibold mb-2">4. Оплата подписки</h2>
        <p class="mb-4">4.1. Стоимость подписки указывается на сайте Сервиса.</p>
        <p class="mb-4">
          4.2. Оплата подписки производится в соответствии с выбранным способом оплаты.
        </p>
        <p class="mb-4">
          4.3. Сервис не несет ответственности за ошибки при выборе способа оплаты.
        </p>
        <h2 class="text-xl font-semibold mb-2">5. Права и обязанности сторон</h2>
        <p class="mb-4">
          5.1. Сервис предоставляет пользователю доступ к музыкальному контенту без авторских прав.
        </p>
        <p class="mb-4">
          5.2. Пользователь обязуется не использовать контент в коммерческих целях без разрешения
          Сервиса.
        </p>
        <p class="mb-4">
          5.3. Сервис оставляет за собой право изменять условия подписки и доступа к контенту.
        </p>
        <p>
          Внимательно ознакомьтесь с текстом пользовательского соглашения, и если Вы не согласны с
          каким-либо пунктом соглашения, Вы вправе отказаться от использования Сервиса.
        </p>
      </div>
    </div>
    <Footer class="mt-10" />
  </div>
</template>
