<script setup lang="ts">
import Header from '@/components/partials/header/index.vue';
import Footer from '@/components/partials/Footer.vue';
</script>

<template>
  <div class="min-h-screen h-full flex flex-col bg-orange-100 relative">
    <Header />
    <div class="max-w-6xl m-auto w-full flex flex-col gap-y-4">
      <div class="flex flex-col w-full p-5 md:p-10 bg-white rounded-xl">
        <h1 class="text-center text-2xl font-bold mb-4">Публичная оферта</h1>
        <h2 class="text-xl font-semibold mb-2">1. ОПРЕДЕЛЕНИЕ ТЕРМИНОВ</h2>
        <p class="mb-4">
          1.1. Публичная оферта (далее – «Оферта») - публичное предложение Поставщика, адресованное
          неопределенному кругу лиц, заключить с Поставщиком договор предоставления доступа к
          музыкальному контенту дистанционным способом (далее - «Договор») на условиях, содержащихся
          в настоящей Оферте, включая все Приложения.
        </p>
        <p class="mb-4">
          1.2. Заказ услуг на сайте сервиса – позиции указанные Пользователем из ассортимента услуг,
          предложенного к предоставлению, при оформлении заявки на получение услуг на сайте сервиса
          или через Оператора.
        </p>
        <h2 class="text-xl font-semibold mb-2">2. ОБЩИЕ ПОЛОЖЕНИЯ</h2>
        <p class="mb-4">
          2.1. Заказ Пользователем услуг, размещенных на сайте сервиса означает, что Пользователь
          согласен со всеми условиями настоящей Оферты.
        </p>
        <p class="mb-4">
          2.2. Администрация сайта сервиса имеет право вносить изменения в Оферту без уведомления
          Пользователя.
        </p>
        <p class="mb-4">
          2.3. Срок действия Оферты не ограничен, если иное не указано на сайте сервиса.
        </p>
        <p class="mb-4">
          2.4. Поставщик предоставляет Пользователю полную и достоверную информацию об услуге,
          включая информацию об основных потребительских свойствах услуги, месте изготовления, а
          также информацию о гарантийном сроке и сроке годности услуги на сайте сервиса, в разделе
          название раздела.
        </p>
        <h2 class="text-xl font-semibold mb-2">3. ЦЕНА УСЛУГИ</h2>
        <p class="mb-4">3.1. Цена на каждую позицию услуги указана на сайте сервиса.</p>
        <p class="mb-4">
          3.2. Поставщик имеет право в одностороннем порядке изменить цену на любую позицию услуги.
        </p>
        <p class="mb-4">
          3.3. В случае изменения цены на заказанную услугу Поставщик обязуется в течение количество
          дней проинформировать Пользователя об изменении цены услуги.
        </p>
        <p class="mb-4">
          3.4. Пользователь вправе подтвердить либо аннулировать Заказ на получение услуги, если
          цена изменена Поставщиком после оформления Заказа.
        </p>
        <p class="mb-4">
          3.5. Изменение Поставщиком цены на оплаченную Пользователем услугу не допускается.
        </p>
        <p class="mb-4">
          3.6. Поставщик указывает стоимость доставки услуги на сайте сервиса либо сообщает
          Пользователю при оформлении заказа Оператором.
        </p>
        <p class="mb-4">
          3.7. Обязательства Пользователя по оплате услуги считаются исполненными с момента
          поступления Поставщиком денежных средств.
        </p>
        <p class="mb-4">
          3.8. Расчеты между Поставщиком и Пользователем за услугу производятся способами,
          указанными на сайте сервиса в разделе название раздела
        </p>
        <h2 class="text-xl font-semibold mb-2">4. ОФОРМЛЕНИЕ ПОДПИСКИ</h2>
        <p class="mb-4">
          4.1. Подписка на услуги осуществляется Пользователем через сервис сайта музыкального
          стримингового сервиса.
        </p>
        <p class="mb-4">
          4.2. При регистрации на сайте музыкального стримингового сервиса Пользователь обязуется
          предоставить следующую регистрационную информацию: 4.2.1. имя Пользователя; 4.2.2. адрес
          электронной почты.
        </p>
        <p class="mb-4">
          4.3. Наименование, срок действия, цена выбранной Пользователем подписки указываются в
          корзине Пользователя на сайте музыкального стримингового сервиса.
        </p>
        <p class="mb-4">
          4.4. Если Поставщику необходима дополнительная информация, он вправе запросить ее у
          Пользователя. В случае не предоставления необходимой информации Пользователем, Поставщик
          не несет ответственности за выбранную Пользователем подписку.
        </p>
        <p class="mb-4">
          4.5. Принятие Пользователем условий настоящей Оферты осуществляется посредством внесения
          Пользователем соответствующих данных в регистрационную форму на сайте музыкального
          стримингового сервиса. Утвердив подписку, Пользователь предоставляет необходимую
          информацию в соответствии с порядком, указанном в п. 4.2. настоящей Оферты.
        </p>
        <p class="mb-4">
          4.6. Поставщик не несет ответственности за содержание и достоверность информации,
          предоставленной Пользователем при оформлении подписки.
        </p>
        <p class="mb-4">
          4.7. Пользователь несет ответственность за достоверность предоставленной информации при
          оформлении подписки.
        </p>
        <p class="mb-4">
          4.8. Договор предоставления услуг дистанционным способом между Поставщиком и Пользователем
          считается заключенным с момента выдачи Поставщиком Пользователю кассового или иного
          документа, подтверждающего оплату подписки.
        </p>
      </div>
    </div>
    <Footer class="mt-10" />
  </div>
</template>
