<script setup lang="ts">
import Header from '@/components/partials/header/index.vue';
import Footer from '@/components/partials/Footer.vue';
</script>

<template>
  <div class="min-h-screen h-full flex flex-col bg-orange-100 relative">
    <Header />
    <div class="max-w-6xl m-auto w-full flex flex-col gap-y-4">
      <div class="flex flex-col w-full p-5 md:p-10 bg-white rounded-xl">
        <h1 class="text-center text-2xl font-bold mb-4">Политика конфиденциальности</h1>
        <h2 class="text-xl font-semibold mb-2 uppercase">1. Введение</h2>
        <p class="mb-4">
          1.1. Настоящая Политика конфиденциальности устанавливает порядок обработки и защиты
          информации о пользователях сервиса "Wave Music".
        </p>
        <p class="mb-4">
          1.2. Целью Политики конфиденциальности является обеспечение надлежащей защиты информации о
          пользователях, включая их персональные данные, от несанкционированного доступа и
          раскрытия.
        </p>
        <h2 class="text-xl font-semibold mb-2 uppercase">2. Сбор и использование персональных данных</h2>
        <p class="mb-4">
          2.1. Сервис собирает персональные данные при регистрации на сайте, при оформлении
          подписки, а также в процессе использования сервиса пользователями.
        </p>
        <p class="mb-4">
          2.2. К персональным данным относятся: имя, адрес электронной почты, платежная информация и
          другие данные, которые пользователь предоставляет о себе добровольно.
        </p>
        <h2 class="text-xl font-semibold mb-2 uppercase">3. Хранение и защита данных</h2>
        <p class="mb-4">
          3.1. Сервис принимает все необходимые меры для защиты данных пользователей от
          неправомерного доступа, изменения, раскрытия или уничтожения.
        </p>
        <p class="mb-4">
          3.2. Персональные данные пользователей хранятся в зашифрованном виде на защищенных
          серверах.
        </p>
        <h2 class="text-xl font-semibold mb-2 uppercase">4. Права пользователя</h2>
        <p class="mb-4">
          4.1. Пользователь имеет право на доступ к своим персональным данным, их исправление,
          удаление или ограничение обработки.
        </p>
        <p class="mb-4">
          4.2. Пользователь может в любой момент отозвать свое согласие на обработку персональных
          данных.
        </p>
        <h2 class="text-xl font-semibold mb-2 uppercase">5. Изменения в политике конфиденциальности</h2>
        <p class="mb-4">
          5.1. Сервис оставляет за собой право вносить изменения в Политику конфиденциальности. О
          всех изменениях пользователи будут уведомлены через сайт Сервиса.
        </p>
        <p>
          Пожалуйста, внимательно ознакомьтесь с Политикой конфиденциальности. Продолжая
          использовать Сервис, Вы подтверждаете свое согласие с изменениями.
        </p>
      </div>
    </div>
    <Footer class="mt-10" />
  </div>
</template>
