<script setup lang="ts">
import Header from '@/components/partials/header/index.vue';
import Footer from '@/components/partials/Footer.vue';
</script>

<template>
  <div class="min-h-screen h-full flex flex-col bg-orange-100 relative">
    <Header />
    <div class="max-w-6xl m-auto w-full flex flex-col gap-y-4">
      <div class="flex flex-col w-full p-5 md:p-10 bg-white rounded-xl">
        <h1 class="text-center text-2xl font-bold mb-4">Условия пользования</h1>
        <h2 class="text-xl font-semibold mb-2 uppercase">1. Введение</h2>
        <p class="mb-4">
          1.1. Настоящие Условия пользования определяют правила использования сервиса "Wave Music" и
          обязательства, возникающие между Сервисом и пользователями.
        </p>
        <p class="mb-4">
          1.2. Использование Сервиса подразумевает полное и безоговорочное принятие пользователем
          данных Условий.
        </p>
        <h2 class="text-xl font-semibold mb-2 uppercase">2. Учетная запись пользователя</h2>
        <p class="mb-4">
          2.1. Для использования Сервиса пользователь должен создать учетную запись, следуя
          инструкциям регистрации.
        </p>
        <p class="mb-4">
          2.2. Пользователь несет ответственность за достоверность предоставляемой информации при
          регистрации.
        </p>
        <p class="mb-4">
          2.3. Пользователь обязуется немедленно сообщать о любых изменениях в предоставленной
          информации.
        </p>
        <h2 class="text-xl font-semibold mb-2 uppercase">3. Использование сервиса</h2>
        <p class="mb-4">
          3.1. Сервис предоставляет пользователю доступ к музыкальному контенту для личного
          некоммерческого использования.
        </p>
        <p class="mb-4">
          3.2. Любое коммерческое использование контента без разрешения Сервиса строго запрещено.
        </p>
        <h2 class="text-xl font-semibold mb-2 uppercase">4. Ответственность</h2>
        <p class="mb-4">
          4.1. Сервис не несет ответственности за временные сбои и перерывы в работе Сервиса, а
          также за любой ущерб, причиненный этим.
        </p>
        <p class="mb-4">
          4.2. Сервис не несет ответственности за действия пользователей, связанные с использованием
          предоставленного контента.
        </p>
        <h2 class="text-xl font-semibold mb-2 uppercase">5. Изменения условий пользования</h2>
        <p class="mb-4">
          5.1. Сервис оставляет за собой право в любое время изменять или дополнять Условия
          пользования без предварительного уведомления.
        </p>
        <p>
          Пользователи обязаны регулярно ознакомляться с изменениями в Условиях. Продолжение
          использования Сервиса после внесения изменений означает их принятие.
        </p>
      </div>
    </div>
    <Footer class="mt-10" />
  </div>
</template>
